{
  "blogs": [
    {
      "id": "1",
      "title": "Getting Started with React",
      "category": "Technology",
      "description": "Learn the basics of React and modern web development",
      "content": "React is a powerful JavaScript library for building user interfaces. In this article, we'll explore the fundamentals of React and how to get started with your first application.",
      "coverImage": "https://images.unsplash.com/photo-1633356122544-f134324a6cee?w=800",
      "date": "2024-01-15T10:00:00.000Z"
    },
    {
      "id": "2",
      "title": "TypeScript Best Practices",
      "category": "Programming",
      "description": "Essential TypeScript patterns for modern applications",
      "content": "TypeScript adds static typing to JavaScript, making your code more maintainable and less error-prone. Here are some best practices to follow.",
      "coverImage": "https://images.unsplash.com/photo-1516116216624-53e697fedbea?w=800",
      "date": "2024-01-18T14:30:00.000Z"
    },
    {
      "id": "3",
      "title": "TanStack Query Guide",
      "category": "Tutorial",
      "description": "Master data fetching with React Query",
      "content": "TanStack Query (formerly React Query) is a powerful data synchronization library. Learn how to use it effectively in your applications.",
      "coverImage": "https://images.unsplash.com/photo-1555066931-4365d14bab8c?w=800",
      "date": "2024-01-20T09:15:00.000Z"
    },
    {
      "id": "8a6a",
      "title": "Getting Started with React as a Beginner",
      "category": "Technology / Programming",
      "description": "Learn the basics of React, including components, state, and props, and how to set up your first React project.",
      "content": "React is a popular JavaScript library used to build fast and interactive user interfaces. It is mainly used for creating single-page applications where the page does not reload again and again.\n\nOne of the main concepts in React is components. Components help us break the UI into small reusable parts. This makes the code easier to understand and maintain.\n\nReact also uses state and props to manage data. State is used for data that changes over time, while props are used to pass data from one component to another.\n\nAnother important feature of React is the Virtual DOM, which makes applications faster by updating only the changed parts of the UI instead of reloading the whole page.\n\nIn conclusion, React is beginner-friendly and very powerful. Learning React opens many opportunities in frontend development and helps in building modern web applications.",
      "coverImage": "https://upload.wikimedia.org/wikipedia/commons/a/a7/React-icon.svg",
      "date": "2026-01-20T11:17:21.482Z"
    }
  ]
}